ДомПласт_локальная_база/src/Catalogs/НалогиСборыОтчисления/НалогиСборыОтчисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НалогиСборыОтчисления</name>
  <predefined>
    <items>
      <name>Акциз</name>
      <description>Акциз</description>
    </items>
    <items>
      <name>ВзносыОбязательноеСоциальноеМедицинскоеСтрахование</name>
      <description>Взносы на обязательное социальное медицинское страхование</description>
    </items>
    <items>
      <name>ИндивидуальныйПодоходныйНалог</name>
      <description>Индивидуальный подоходный налог</description>
    </items>
    <items>
      <name>ИндивидуальныйПодоходныйНалогИностранныеГраждане</name>
      <description>Индивидуальный подоходный налог за иностранных граждан</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимость</name>
      <description>Налог на добавленную стоимость</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимостьСИзмененнымСрокомУплаты</name>
      <description>Налог на добавленную стоимость с измененным сроком уплаты</description>
    </items>
    <items>
      <name>НалогНаИмущество</name>
      <description>Налог на имущество</description>
    </items>
    <items>
      <name>НалогНаПрибыль</name>
      <description>Налог на прибыль (корпоративный подоходный налог)</description>
    </items>
    <items>
      <name>НалогНаТранспорт</name>
      <description>Налог на транспорт</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимостьЗаНерезидента</name>
      <description>НДС за нерезидента</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимостьИмпортРБ</name>
      <description>НДС на товары таможенного союза, ввозимые с территории РБ</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимостьИмпортРФ</name>
      <description>НДС на товары таможенного союза, ввозимые с территории РФ</description>
    </items>
    <items>
      <name>ОбязательныеПенсионныеВзносы</name>
      <description>Обязательные пенсионные взносы</description>
    </items>
    <items>
      <name>ОбязательныеПрофессиональныеПенсионныеВзносы</name>
      <description>Обязательные профессиональные пенсионные взносы</description>
    </items>
    <items>
      <name>ОбязательныеСоциальныеОтчисления</name>
      <description>Обязательные социальные отчисления</description>
    </items>
    <items>
      <name>ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование</name>
      <description>Отчисления на обязательное социальное медицинское страхование</description>
    </items>
    <items>
      <name>СоциальныйНалог</name>
      <description>Социальный налог</description>
    </items>
    <items>
      <name>СоциальныйНалогИнвалиды</name>
      <description>Социальный налог за инвалидов</description>
    </items>
    <items>
      <name>СоциальныйНалогИностранныеСпециалисты</name>
      <description>Социальный налог за иностранных специалистов</description>
    </items>
  </predefined>
  <attributes>
    <name>КодБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНазначенияПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКонтрагентомБУ</name>
    <type>
      <types>ChartOfAccountsRef.Типовой</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКонтрагентомНУ</name>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтноситьНаВычетыВПределахУплаченнойСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ДомПласт_локальная_база/src/Catalogs/НалогиСборыОтчисления/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ  ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.ФормаВыбораИзКлассификатора") Тогда
		
		Если ВРег(ИсточникВыбора.ИмяМакета) = ВРег("КодыНазначенияПлатежей") Тогда 
			Если  ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
				
				Объект.КодНазначенияПлатежа = ВыбранноеЗначение;
			Иначе
				Объект.КодНазначенияПлатежа = ВыбранноеЗначение.КодСтроки;
			КонецЕсли;
			
			
		ИначеЕсли ВРег(ИсточникВыбора.ИмяМакета) = ВРег("КодыБюджетнойКлассификации") Тогда 
			
			Если  ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
				
				Объект.КодБК = ВыбранноеЗначение;
			Иначе
				Объект.КодБК = ВыбранноеЗначение.КодСтроки;
			КонецЕсли;
			
		КонецЕсли;
		
		Модифицированность = Истина;

	КонецЕсли;	

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СчетУчетаРасчетовСКонтрагентомБУПриИзменении(Элемент)
	
	Объект.СчетУчетаРасчетовСКонтрагентомНУ = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ", Объект.СчетУчетаРасчетовСКонтрагентомБУ));

КонецПроцедуры

&НаКлиенте
Процедура КодБКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора"		  , Истина);
	ПараметрыФормы.Вставить("ИмяМакета"			  , "КодыБюджетнойКлассификации");
	ПараметрыФормы.Вставить("ИмяСекции"			  ,	"Классификатор");
	ПараметрыФормы.Вставить("ПолучатьПолныеДанные", Истина);
	ПараметрыФормы.Вставить("ТекущийКодСтроки"	  , ?(НЕ ЗначениеЗаполнено(Объект.КодБК), Неопределено, СокрЛП(Объект.КодБК)));

	ФормаВыбораКода = ПолучитьФорму("ОбщаяФорма.ФормаВыбораИзКлассификатора", ПараметрыФормы, ЭтаФорма, Истина);
	
	ФормаВыбораКода.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура КодНазначенияПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора"		  , Истина);
	ПараметрыФормы.Вставить("ИмяМакета"			  , "КодыНазначенияПлатежей");
	ПараметрыФормы.Вставить("ИмяСекции"			  ,	"Классификатор");
	ПараметрыФормы.Вставить("ПолучатьПолныеДанные", Истина);
	ПараметрыФормы.Вставить("ТекущийКодСтроки"	  , ?(НЕ ЗначениеЗаполнено(Объект.КодНазначенияПлатежа), Неопределено, СокрЛП(Объект.КодНазначенияПлатежа)));

	ФормаВыбораКода = ПолучитьФорму("ОбщаяФорма.ФормаВыбораИзКлассификатора", ПараметрыФормы, ЭтаФорма, Истина);
	
	ФормаВыбораКода.Открыть();


КонецПроцедуры

&НаКлиенте
Процедура НазначениеПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДополнительныеПараметры = Новый Структура("ФормаВладелец,ИмяРеквизита", ЭтаФорма, "НазначениеПлатежа");
	Оповещение = Новый ОписаниеОповещения("НазначениеПлатежаЗавершениеВвода", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(
		Оповещение,
		Объект.НазначениеПлатежа,
		НСтр("ru='Назначение платежа'"));

КонецПроцедуры
	
&НаКлиенте
Процедура СтатьяЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		                   	
	Если Объект.ОтноситьНаВычетыВПределахУплаченнойСуммы Тогда
		
		ПараметрыФормыВыбора = Новый Структура("РежимВыбора", Истина);
		
		Результат = ПолучитьФорму("Справочник.СтатьиЗатрат.ФормаВыбора",	ПараметрыФормыВыбора, Элемент);
		
		Результат.Открыть();
		
		ЭлементОтбора = Результат.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ВидРасходовНУ");
		ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование    = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение   = ПредопределенноеЗначение("Справочник.ВидыРасходовНУ.НалогиВГосБюджет");
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	              
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура НазначениеПлатежаЗавершениеВвода(Строка, Параметры) Экспорт

	Если Строка <> Неопределено Тогда
		
		Объект.НазначениеПлатежа = Строка;
		
	КонецЕсли;
	
КонецПроцедуры
